package game.shenle.com

/**
 * Created by shenle on 2017/11/10.
 */
class sign{
    private val name = "笔客江湖"
    private val person = "人物设定" +
            "双人进入注册有,本人猪脚,另一半2号(有加成)" +
            "独行侠(属性低),后期可以邀请"
    private val detail = "人物属性" +
            "血条(0-100)健康状态低于0或者饥饿度为0开始掉血" +
            "饥饿度(0-100)" +
            "健康状态(0~100,疾病(...),中毒)" +
            "心情值(-100~0~100)影响情绪,作出的决定" +
            "武力值(0~)" +
            "智商(0~250)" +
            "幸运值(0~100)"
    private val tool = "装备" +
            "工具类" +
            "武器类" +
            "防具类" +
            "装饰类" +
            "特殊物品" +
            "任务物品"
    private val about = "一款文字游戏,以小说对话的模式,展开情节," +
            "每天开始,有江湖日报" +
            "每天结束,生成江湖日志" +
            "榜单" +
            "特殊事件触发" +
            "个人状态" +
            "称号系统" +
            "势力系统" +
            "职业" +
            "货币系统" +
            "家庭"
    init{
        "首先欢迎界面->" +
         "选择:继续游戏/新建角色" +
                ",单人模式,双人模式,龙套体验,上帝视角观看,上帝视角管理(管理员权限可以控制管理)" +
                "(新建角色说明:角色性格选择,后面待定:双人角色(输入另一半手机号注册),和单人角色(后期邀请角色,另一半剧情清空))->" +
                    "角色性格选择,其实应该是剧本选择,为了后续,留管理位置,新增剧本,1个剧本只能建一个角色"
    }
}